dialog/smsmessaging-libs/DialogUtilities_1.4/conf/Copy of config.xml

<?xml version="1.0" encoding="UTF-8"?>
<admin>			
	<cgw>
		<billUrl>http://192.168.7.133/CGWebService?wsdl</billUrl>
		<billAppID>HASHB</billAppID>
		<billUsername>HASHB</billUsername>
		<billPassword>hash</billPassword>
		<domainID>GSM</domainID>		
		<smsRCode>277</smsRCode>
			
		<billUrl>http://172.26.1.45:8989/CGWebService?wsdl</billUrl1>		
		<billAppID>MUSIC_OD</billAppID>
		<billUsername>MUSIC_OD</billUsername>
		<billPassword>IVRmusiC</billPassword>
		<domainID>GSM</domainID>		
		<smsRCode>329</smsRCode>
		<mmsRCode>329</mmsRCode>
		<pointsRCode>329</pointsRCode>
		<smsCharge>2</smsCharge>
		<mmsCharge>7</mmsCharge>		
		<requests>
			<req_transactionKey><![CDATA[ <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><getSessionKey xmlns="urn:lk.dialog.cg.ws.types"><String_1 xmlns="">{0}</String_1><arrayOfbyte_2 xmlns="">{1}</arrayOfbyte_2></getSessionKey></soapenv:Body></soapenv:Envelope> ]]></req_transactionKey>
			<req_creditCheck><![CDATA[ <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><performCreditCheck xmlns="urn:lk.dialog.cg.ws.types"><CreditCheckRequest_1 xmlns=""><appID>{0}</appID><authKey>{1}</authKey><domainID>{2}</domainID><refAccount>{3}</refAccount><transactionID>{4}</transactionID></CreditCheckRequest_1></performCreditCheck></soapenv:Body></soapenv:Envelope> ]]></req_creditCheck>			
			<req_chargeToBill><![CDATA[ <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><chargeToBill xmlns="urn:lk.dialog.cg.ws.types"><ChargedToBillRequest_1 xmlns=""><appID>{0}</appID><authKey>{1}</authKey><domainID>{2}</domainID><refAccount>{3}</refAccount><transactionID>{4}</transactionID><accountRef xsi:nil="true"/><amount>{5}</amount><reasonCode>{6}</reasonCode><taxable>{7}</taxable></ChargedToBillRequest_1></chargeToBill></soapenv:Body></soapenv:Envelope> ]]></req_chargeToBill>
		</requests>
	</cgw>	
</admin>

